---
title: ReferencePlane
classe: Autodesk.Revit.DB.ReferencePlane
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.DatumPlane
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ReferencePlane

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ BubbleEnd { get; set; }` | `referencePlane.BubbleEnd` | XYZ |
| `XYZ Direction { get; set; }` | `referencePlane.Direction` | XYZ |
| `XYZ FreeEnd { get; set; }` | `referencePlane.FreeEnd` | XYZ |
| `String Name { get; set; }` | `referencePlane.Name` | String |
| `XYZ Normal { get; }` | `referencePlane.Normal` | XYZ |
| `Void Flip()` | `referencePlane.Flip()` | Void |
| `Plane GetPlane()` | `referencePlane.GetPlane()` | Plane |
| `Reference GetReference()` | `referencePlane.GetReference()` | Reference |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```